app/views/participants/_participant.html.erb

SELECT "days".* FROM "days" INNER JOIN "participant_days" ON "days"."id" = "participant_days"."day_id" WHERE "participant_days"."participant_id" = $1  [["participant_id", 51]]
---
    <td><%=participant.cost - participant.paid %> </td>
    <td><%=participant.days.include?(Day.find_by_number(1))%></td>

SELECT  1 AS one FROM "nights" INNER JOIN "participant_nights" ON "nights"."id" = "participant_nights"."night_id" WHERE "participant_nights"."participant_id" = $1 AND "nights"."id" = 35 LIMIT 1  [["participant_id", 51]]
SELECT "nights".* FROM "nights" INNER JOIN "participant_nights" ON "nights"."id" = "participant_nights"."night_id" WHERE "participant_nights"."participant_id" = $1  [["participant_id", 51]]
SELECT  1 AS one FROM "dinners" INNER JOIN "participant_dinners" ON "dinners"."id" = "participant_dinners"."dinner_id" WHERE "participant_dinners"."participant_id" = $1 AND "dinners"."id" = 35 LIMIT 1  [["participant_id", 51]]
SELECT "dinners".* FROM "dinners" INNER JOIN "participant_dinners" ON "dinners"."id" = "participant_dinners"."dinner_id" WHERE "participant_dinners"."participant_id" = $1  [["participant_id", 51]]
---
    <td><%=participant.days.include?(Day.find_by_number(3))%></td>
    <td><%=participant.nights.include?(Night.find_by_number(1))%></td>
    <td><%=participant.nights.include?(Night.find_by_number(2))%></td>
    <td><%=participant.dinners.include?(Dinner.find_by_number(1))%></td>

SELECT "roles".* FROM "roles"
---
        <%= f.number_field :paid %>
        <%= f.collection_select :role_id, Role.all, :id, :name %>