app/views/participants/_update.html.erb

SELECT "roles".* FROM "roles"
---
<div class="form-row">
      <%= f.collection_select :role_id, Role.all, :id, :name, {}, {:class => "change-select sbHolder"} %>

SELECT  "days".* FROM "days"  WHERE "days"."number" = 1 LIMIT 1
SELECT "nights".* FROM "nights"
SELECT "dinners".* FROM "dinners"
---
<div class="form-row">
      <%= f.select :day_ids, Day.all.map{|x| ["Dzień " + x.number.to_s, x.id]} , {}, {multiple: true}%>
      <%= f.select :night_ids, Night.all.map{|x| ["Nocleg " + x.number.to_s, x.id]} , {}, {multiple: true}%>
      <%= f.select :dinner_ids, Dinner.all.map{|x| ["Obiad " + x.number.to_s, x.id]} , {}, {multiple: true}%>