app/controllers/participants_controller.rb

UPDATE "participants" SET "cost" = $1, "payment_deadline" = $2, "updated_at" = $3 WHERE "participants"."id" = 51  [["cost", 70], ["payment_deadline", "2014-12-31 00:00:00.000000"], ["updated_at", "2014-12-27 02:10:00.367133"]]
SELECT  "roles".* FROM "roles"  WHERE "roles"."id" = $1 LIMIT 1  [["id", 36]]
SELECT "days".* FROM "days" INNER JOIN "participant_days" ON "days"."id" = "participant_days"."day_id" WHERE "participant_days"."participant_id" = $1  [["participant_id", 51]]
SELECT "dinners".* FROM "dinners" INNER JOIN "participant_dinners" ON "dinners"."id" = "participant_dinners"."dinner_id" WHERE "participant_dinners"."participant_id" = $1  [["participant_id", 51]]
SELECT "nights".* FROM "nights" INNER JOIN "participant_nights" ON "nights"."id" = "participant_nights"."night_id" WHERE "participant_nights"."participant_id" = $1  [["participant_id", 51]]
---
  def edit
    @participant = Participant.find(params[:id])
    parameters = params.require(:participant).permit(:name, :surname, :age, :city, :email, :phone)
    @participant.update(parameters)
    role_id = params[:participant][:role_id]
    @participant.role = Role.find(role_id)

    day_ids = params[:participant][:day_ids]
    dinner_ids = params[:participant][:dinner_ids]
    night_ids = params[:participant][:night_ids]

    day_ids.reject! {|d| d.empty?}
    dinner_ids.reject! {|d| d.empty?}
    night_ids.reject! {|d| d.empty?}

    @participant.days = Day.none
    @participant.dinners = Dinner.none
    @participant.nights = Night.none

    day_ids.each do |d|
      @participant.days.push(Day.find(d.to_i))

SELECT "days".* FROM "days"  WHERE "days"."id" IN (52, 53, 54)
SELECT "roles".* FROM "roles"  WHERE "roles"."id" IN (39, 36)
---
  def summary
    @participants = Participant.includes(:days).includes(:role).all

SELECT "days".* FROM "days"  WHERE "days"."id" IN (52, 53, 54)
SELECT "roles".* FROM "roles"  WHERE "roles"."id" IN (36, 39)
---
  def index
    @participants = Participant.includes(:days).includes(:role).all.order("participants.created_at ASC")

SELECT  "roles".* FROM "roles"  WHERE "roles"."id" = $1 LIMIT 1  [["id", 36]]
UPDATE "participants" SET "paid" = $1, "updated_at" = $2 WHERE "participants"."id" = 51  [["paid", 203.0], ["updated_at", "2014-12-24 00:56:15.125687"]]
---
  def edit_payment
    @participant = Participant.find(params[:id])
    @participant.paid = params[:participant][:paid]
    if params[:participant][:role_id]
      @participant.role = Role.find(params[:participant][:role_id])
    end
    @participant.save!